# ConnectorAngleOfDeflection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ConnectorAngleOfDeflection Property
ParameterTypeId Class See Also
---
"Angle of Deflection"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ConnectorAngleOfDeflection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConnectorAngleOfDeflection As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ConnectorAngleOfDeflection {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace